Tensorflow model for the U-Net architecture:

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv3d_1 (Conv3D)            (None, 153, 238, 238, 32) 896       
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 76, 119, 119, 32)  0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 76, 119, 119, 32)  0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 74, 117, 117, 64)  55360     
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 37, 58, 58, 64)    0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 37, 58, 58, 64)    0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 35, 56, 56, 128)   221312    
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 17, 28, 28, 128)   0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 17, 28, 28, 128)   0         
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 15, 26, 26, 256)   884992    
_________________________________________________________________
max_pooling3d_4 (MaxPooling3 (None, 7, 13, 13, 256)    0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 7, 13, 13, 256)    0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 5, 11, 11, 512)    3539456   
_________________________________________________________________
dropout_5 (Dropout)          (None, 5, 11, 11, 512)    0         
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 7, 13, 13, 256)    3539200   
_________________________________________________________________
dropout_6 (Dropout)          (None, 7, 13, 13, 256)    0         
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 5, 11, 11, 256)    1769728   
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 7, 13, 13, 128)    884864    
_________________________________________________________________
dropout_7 (Dropout)          (None, 7, 13, 13, 128)    0         
_________________________________________________________________
conv3d_7 (Conv3D)            (None, 5, 11, 11, 128)    442496    
_________________________________________________________________
conv3d_transpose_3 (Conv3DTr (None, 7, 13, 13, 64)     221248    
_________________________________________________________________
dropout_8 (Dropout)          (None, 7, 13, 13, 64)     0         
_________________________________________________________________
conv3d_8 (Conv3D)            (None, 5, 11, 11, 64)     110656    
_________________________________________________________________
conv3d_transpose_4 (Conv3DTr (None, 7, 13, 13, 32)     55328     
_________________________________________________________________
dropout_9 (Dropout)          (None, 7, 13, 13, 32)     0         
_________________________________________________________________
conv3d_9 (Conv3D)            (None, 5, 11, 11, 32)     27680     
_________________________________________________________________
conv3d_10 (Conv3D)           (None, 5, 11, 11, 1)      33        
=================================================================
Total params: 11,753,249
Trainable params: 11,753,249
Non-trainable params: 0
_________________________________________________________________